Tekla.Structures.ModelInternal.IInputGeometryEvents
Interface for the Events class allows the user to register event listeners for Model UI events.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.ModelInternal.IInputGeometryEvents.PointInputChanged
The PointInputChanged event is raised when the user changes the input geometry ins Tekla Structures view.

Tekla.Structures.ModelInternal.IInputGeometryEvents.OnPointInputChangedEvent(System.String,System.Object[])


Tekla.Structures.ModelInternal.IInputGeometryEvents.Register
Registers the instance to listen to the specified events.
More event delegates should not be added without calling UnRegister
first.

Tekla.Structures.ModelInternal.IInputGeometryEvents.UnRegister
Unregisters the instance from listening to events.